[
  {"id":"alomMicroscopicNucleiClassification2022","abstract":"Nuclei classification, segmentation, and detection from pathological images are challenging tasks due to cellular heterogeneity in the Whole Slide Images (WSI).","accessed":{"date-parts":[[2023,3,18]]},"author":[{"family":"Alom","given":"Zahangir"},{"family":"Asari","given":"Vijayan K."},{"family":"Parwani","given":"Anil"},{"family":"Taha","given":"Tarek M."}],"citation-key":"alomMicroscopicNucleiClassification2022","container-title":"Diagnostic Pathology","container-title-short":"Diagnostic Pathology","DOI":"10.1186/s13000-022-01189-5","ISSN":"1746-1596","issue":"1","issued":{"date-parts":[[2022,4,19]]},"page":"38","source":"BioMed Central","title":"Microscopic nuclei classification, segmentation, and detection with improved deep convolutional neural networks (DCNN)","type":"article-journal","URL":"https://doi.org/10.1186/s13000-022-01189-5","volume":"17"},
  {"id":"BackgroundWhyHoloViz","accessed":{"date-parts":[[2023,3,10]]},"citation-key":"BackgroundWhyHoloViz","title":"Background: Why HoloViz? — HoloViz 0.16.1 documentation","type":"webpage","URL":"https://holoviz.org/background.html"},
  {"id":"BackgroundWhyHoloViza","accessed":{"date-parts":[[2023,3,10]]},"citation-key":"BackgroundWhyHoloViza","title":"Background: Why HoloViz? — HoloViz 0.16.1 documentation","type":"webpage","URL":"https://holoviz.org/background.html#shortcuts-not-dead-ends"},
  {"id":"basuSurveyRecentTrends2023","abstract":"Nucleus segmentation is an imperative step in the qualitative study of imaging datasets, considered as an intricate task in histopathology image analysis. Segmenting a nucleus is an important part of diagnosing, staging, and grading cancer, but overlapping regions make it hard to separate and tell apart independent nuclei. Deep Learning is swiftly paving its way in the arena of nucleus segmentation, attracting quite a few researchers with its numerous published research articles indicating its efficacy in the field. This paper presents a systematic survey on nucleus segmentation using deep learning in the last five years (2017–2021), highlighting various segmentation models (U-Net, SCPP-Net, Sharp U-Net, and LiverNet) and exploring their similarities, strengths, datasets utilized, and unfolding research areas.","accessed":{"date-parts":[[2023,3,18]]},"author":[{"family":"Basu","given":"Anusua"},{"family":"Senapati","given":"Pradip"},{"family":"Deb","given":"Mainak"},{"family":"Rai","given":"Rebika"},{"family":"Dhal","given":"Krishna Gopal"}],"citation-key":"basuSurveyRecentTrends2023","container-title":"Evolving Systems","container-title-short":"Evolving Systems","DOI":"10.1007/s12530-023-09491-3","ISSN":"1868-6486","issued":{"date-parts":[[2023,3,6]]},"language":"en","source":"Springer Link","title":"A survey on recent trends in deep learning for nucleus segmentation from histopathology images","type":"article-journal","URL":"https://doi.org/10.1007/s12530-023-09491-3"},
  {"id":"bergIlastikInteractiveMachine2019","abstract":"We present ilastik, an easy-to-use interactive tool that brings machine-learning-based (bio)image analysis to end users without substantial computational expertise. It contains pre-defined workflows for image segmentation, object classification, counting and tracking. Users adapt the workflows to the problem at hand by interactively providing sparse training annotations for a nonlinear classifier. ilastik can process data in up to five dimensions (3D, time and number of channels). Its computational back end runs operations on-demand wherever possible, allowing for interactive prediction on data larger than RAM. Once the classifiers are trained, ilastik workflows can be applied to new data from the command line without further user interaction. We describe all ilastik workflows in detail, including three case studies and a discussion on the expected performance.","accessed":{"date-parts":[[2022,7,21]]},"author":[{"family":"Berg","given":"Stuart"},{"family":"Kutra","given":"Dominik"},{"family":"Kroeger","given":"Thorben"},{"family":"Straehle","given":"Christoph N."},{"family":"Kausler","given":"Bernhard X."},{"family":"Haubold","given":"Carsten"},{"family":"Schiegg","given":"Martin"},{"family":"Ales","given":"Janez"},{"family":"Beier","given":"Thorsten"},{"family":"Rudy","given":"Markus"},{"family":"Eren","given":"Kemal"},{"family":"Cervantes","given":"Jaime I."},{"family":"Xu","given":"Buote"},{"family":"Beuttenmueller","given":"Fynn"},{"family":"Wolny","given":"Adrian"},{"family":"Zhang","given":"Chong"},{"family":"Koethe","given":"Ullrich"},{"family":"Hamprecht","given":"Fred A."},{"family":"Kreshuk","given":"Anna"}],"citation-key":"bergIlastikInteractiveMachine2019","container-title":"Nature Methods","container-title-short":"Nat Methods","DOI":"10.1038/s41592-019-0582-9","ISSN":"1548-7105","issue":"12","issued":{"date-parts":[[2019,12]]},"language":"en","license":"2019 The Author(s), under exclusive licence to Springer Nature America, Inc.","number":"12","page":"1226-1232","publisher":"Nature Publishing Group","source":"www.nature.com","title":"ilastik: interactive machine learning for (bio)image analysis","title-short":"ilastik","type":"article-journal","URL":"https://www.nature.com/articles/s41592-019-0582-9","volume":"16"},
  {"id":"bockGeneralizedVoronoiTessellation2010","abstract":"Voronoi tessellations have been used to model the geometric arrangement of cells in morphogenetic or cancerous tissues, however, so far only with flat hyper-surfaces as cell-cell contact borders. In order to reproduce the experimentally observed piecewise spherical boundary shapes, we develop a consistent theoretical framework of multiplicatively weighted distance functions, defining generalized finite Voronoi neighborhoods around cell bodies of varying radius, which serve as heterogeneous generators of the resulting model tissue. The interactions between cells are represented by adhesive and repelling force densities on the cell contact borders. In addition, protrusive locomotion forces are implemented along the cell boundaries at the tissue margin, and stochastic perturbations allow for non-deterministic motility effects. Simulations of the emerging system of stochastic differential equations for position and velocity of cell centers show the feasibility of this Voronoi method generating realistic cell shapes. In the limiting case of a single cell pair in brief contact, the dynamical nonlinear Ornstein–Uhlenbeck process is analytically investigated. In general, topologically distinct tissue conformations are observed, exhibiting stability on different time scales, and tissue coherence is quantified by suitable characteristics. Finally, an argument is derived pointing to a tradeoff in natural tissues between cell size heterogeneity and the extension of cellular lamellae.","accessed":{"date-parts":[[2023,2,9]]},"author":[{"family":"Bock","given":"Martin"},{"family":"Tyagi","given":"Amit Kumar"},{"family":"Kreft","given":"Jan-Ulrich"},{"family":"Alt","given":"Wolfgang"}],"citation-key":"bockGeneralizedVoronoiTessellation2010","container-title":"Bulletin of Mathematical Biology","container-title-short":"Bull. Math. Biol.","DOI":"10.1007/s11538-009-9498-3","ISSN":"1522-9602","issue":"7","issued":{"date-parts":[[2010,10,1]]},"language":"en","page":"1696-1731","source":"Springer Link","title":"Generalized Voronoi Tessellation as a Model of Two-dimensional Cell Tissue Dynamics","type":"article-journal","URL":"https://doi.org/10.1007/s11538-009-9498-3","volume":"72"},
  {"id":"communityTrackMateV7Cell2022","abstract":"We proudly present a new version of TrackMate, which provides a collection of new detectors, including deep-learning models, and new visualisation and analysis tools that strongly improve and facilitate studies on the dynamics of cells and objects.","accessed":{"date-parts":[[2023,3,11]]},"author":[{"family":"Community","given":"Springer Nature Protocols and Methods"}],"citation-key":"communityTrackMateV7Cell2022","container-title":"Springer Nature Protocols and Methods Community","issued":{"date-parts":[[2022,6,3]]},"language":"en","section":"Behind the Paper","title":"TrackMate v7, cell tracking for everyone with (almost) everything","type":"webpage","URL":"http://protocolsmethods.springernature.com/posts/trackmate-v7-cell-tracking-for-everyone-with-almost-everything"},
  {"id":"DeepLabCut","accessed":{"date-parts":[[2023,3,9]]},"citation-key":"DeepLabCut","container-title":"The Mathis Lab of Adaptive Motor Control","language":"en-US","title":"DeepLabCut","type":"webpage","URL":"http://www.mackenziemathislab.org/deeplabcut-home"},
  {"id":"downeyLineageTrackerStatisticalScoring2011","abstract":"Automated high-throughput analysis of single-cell timecourse data presents a major bottleneck in live cell imaging. We present LineageTracker, an ImageJ framework to track expression of fluorescent gene reporters over multiple cell divisions. It is able to perform automatic segmentation and tracking, and allows viewing and editing of tracks. The main feature of the tracking algorithm is a statistical scoring method which takes into account characteristic intensity and size changes to classify dividing and non-dividing cells. By including such dynamic features, the method can identify dividing cells in time series with 30 min frame intervals, and handle large cell displacements between frames. We created a manually validated data set of mouse C2C12 cells expressing a fluorescent protein targeted to the cell nucleus which we will make available for benchmarking different segmentation and tracking methods.","author":[{"family":"Downey","given":"Mike"},{"family":"Vance","given":"Keith W"},{"family":"Bretschneider","given":"Till"}],"citation-key":"downeyLineageTrackerStatisticalScoring2011","container-title":"2011 IEEE International Symposium on Biomedical Imaging: From Nano to Macro","DOI":"10.1109/ISBI.2011.5872783","event-title":"2011 IEEE International Symposium on Biomedical Imaging: From Nano to Macro","ISSN":"1945-8452","issued":{"date-parts":[[2011,3]]},"page":"1913-1916","source":"IEEE Xplore","title":"LineageTracker: A statistical scoring method for tracking cell lineages in large cell populations with low temporal resolution","title-short":"LineageTracker","type":"paper-conference"},
  {"id":"emamiComputerizedCellTracking2021","abstract":"In developmental biology, knowledge of cell structure and their (morpho) dynamic behavior, leads to a comprehensive understanding of their conducts and the mechanisms in which they participate. This knowledge is a decisive factor in biological research and also in all drug development steps, medicinal or preventive therapies. Experimental cell analysis is hard, expensive, and time-consuming. To overcome these difficulties, in recent years, several computational object tracking methods, software system and packages have been developed in cell sciences that bring together different disciplines and branches of technologies. Object tracking is the process of locating and monitoring specific object and its behavior in sequential images. In this paper, a comprehensive review on object tracking stages and computational methods that are utilized in terms of cell tracking has been organized. Besides, the available software packages and toolkits, challenges, and their solution in time lapse microscopy images in this scope were reviewed. The aim of describing computational cell tracking methods and tools is that biologist and cell scientists might take advantage of these computational techniques to find another method to gain complementary information for their question of interest.","accessed":{"date-parts":[[2022,8,18]]},"author":[{"family":"Emami","given":"Neda"},{"family":"Sedaei","given":"Zahra"},{"family":"Ferdousi","given":"Reza"}],"citation-key":"emamiComputerizedCellTracking2021","container-title":"Visual Informatics","container-title-short":"Visual Informatics","DOI":"10.1016/j.visinf.2020.11.003","ISSN":"2468-502X","issue":"1","issued":{"date-parts":[[2021,3,1]]},"language":"en","page":"1-13","source":"ScienceDirect","title":"Computerized cell tracking: Current methods, tools and challenges","title-short":"Computerized cell tracking","type":"article-journal","URL":"https://www.sciencedirect.com/science/article/pii/S2468502X20300711","volume":"5"},
  {"id":"ershovTrackMateIntegratingStateoftheart2022","abstract":"TrackMate is an automated tracking software used to analyze bioimages and is distributed as a Fiji plugin. Here, we introduce a new version of TrackMate. TrackMate 7 is built to address the broad spectrum of modern challenges researchers face by integrating state-of-the-art segmentation algorithms into tracking pipelines. We illustrate qualitatively and quantitatively that these new capabilities function effectively across a wide range of bio-imaging experiments.","accessed":{"date-parts":[[2023,3,12]]},"author":[{"family":"Ershov","given":"Dmitry"},{"family":"Phan","given":"Minh-Son"},{"family":"Pylvänäinen","given":"Joanna W."},{"family":"Rigaud","given":"Stéphane U."},{"family":"Le Blanc","given":"Laure"},{"family":"Charles-Orszag","given":"Arthur"},{"family":"Conway","given":"James R. W."},{"family":"Laine","given":"Romain F."},{"family":"Roy","given":"Nathan H."},{"family":"Bonazzi","given":"Daria"},{"family":"Duménil","given":"Guillaume"},{"family":"Jacquemet","given":"Guillaume"},{"family":"Tinevez","given":"Jean-Yves"}],"citation-key":"ershovTrackMateIntegratingStateoftheart2022","container-title":"Nature Methods","container-title-short":"Nat Methods","DOI":"10.1038/s41592-022-01507-1","ISSN":"1548-7105","issue":"7","issued":{"date-parts":[[2022,7]]},"language":"en","license":"2022 The Author(s), under exclusive licence to Springer Nature America, Inc.","number":"7","page":"829-832","publisher":"Nature Publishing Group","source":"www.nature.com","title":"TrackMate 7: integrating state-of-the-art segmentation algorithms into tracking pipelines","title-short":"TrackMate 7","type":"article-journal","URL":"https://www.nature.com/articles/s41592-022-01507-1","volume":"19"},
  {"id":"FUCCItrackAllinoneSoftware","accessed":{"date-parts":[[2022,8,17]]},"citation-key":"FUCCItrackAllinoneSoftware","title":"FUCCItrack: An all-in-one software for single cell tracking and cell cycle analysis | PLOS ONE","type":"webpage","URL":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0268297"},
  {"id":"ghannoumCellMAPtracerUserFriendlyTracking2021","abstract":"Cell migration is a fundamental biological process of key importance in health and disease. Advances in imaging techniques have paved the way to monitor cell motility. An ever-growing collection of computational tools to track cells has improved our ability to analyze moving cells. One renowned goal in the field is to provide tools that track cell movement as comprehensively and automatically as possible. However, fully automated tracking over long intervals of time is challenged by dividing cells, thus calling for a combination of automated and supervised tracking. Furthermore, after the emergence of various experimental tools to monitor cell-cycle phases, it is of relevance to integrate the monitoring of cell-cycle phases and motility. We developed CellMAPtracer, a multiplatform tracking system that achieves that goal. It can be operated as a conventional, automated tracking tool of single cells in numerous imaging applications. However, CellMAPtracer also allows adjusting tracked cells in a semiautomated supervised fashion, thereby improving the accuracy and facilitating the long-term tracking of migratory and dividing cells. CellMAPtracer is available with a user-friendly graphical interface and does not require any coding or programming skills. CellMAPtracer is compatible with two- and three-color fluorescent ubiquitination-based cell-cycle indicator (FUCCI) systems and allows the user to accurately monitor various migration parameters throughout the cell cycle, thus having great potential to facilitate new discoveries in cell biology.","accessed":{"date-parts":[[2022,8,18]]},"author":[{"family":"Ghannoum","given":"Salim"},{"family":"Antos","given":"Kamil"},{"family":"Leoncio Netto","given":"Waldir"},{"family":"Gomes","given":"Cecil"},{"family":"Köhn-Luque","given":"Alvaro"},{"family":"Farhan","given":"Hesso"}],"citation-key":"ghannoumCellMAPtracerUserFriendlyTracking2021","container-title":"Cells","DOI":"10.3390/cells10020469","ISSN":"2073-4409","issue":"2","issued":{"date-parts":[[2021,2]]},"language":"en","license":"http://creativecommons.org/licenses/by/3.0/","number":"2","page":"469","publisher":"Multidisciplinary Digital Publishing Institute","source":"www.mdpi.com","title":"CellMAPtracer: A User-Friendly Tracking Tool for Long-Term Migratory and Proliferating Cells Associated with FUCCI Systems","title-short":"CellMAPtracer","type":"article-journal","URL":"https://www.mdpi.com/2073-4409/10/2/469","volume":"10"},
  {"id":"GuidesBetterScience","citation-key":"GuidesBetterScience","publisher":"British Ecological Society","title":"Guides to Better Science - Reproducible Code","type":"document","URL":"https://www.britishecologicalsociety.org/wp-content/uploads/2019/06/BES-Guide-Reproducible-Code-2019.pdf"},
  {"id":"hallAlmostUniformDistributions1974","abstract":"The use of a gray level transformation which transforms a given empirical distribution function of gray level values in an image into a uniform distribution has been used as an image enhancement as well as for a normalization procedure. This transformation produces a discrete variable whose empirical distribution might be expected to be approximately uniform since it is related to the well known distribution transformation. In this correspondence, an extension of the theorem is given which shows that the theorem \"almost\" holds for an \"almost\" continuous input distribution. The application of the discrete distribution transformation to computer image enhancement is considered.","author":[{"family":"Hall","given":"E.L."}],"citation-key":"hallAlmostUniformDistributions1974","container-title":"IEEE Transactions on Computers","DOI":"10.1109/T-C.1974.223892","ISSN":"1557-9956","issue":"2","issued":{"date-parts":[[1974,2]]},"page":"207-208","source":"IEEE Xplore","title":"Almost Uniform Distributions for Computer Image Enhancement","type":"article-journal","volume":"C-23"},
  {"id":"jaqamanRobustSingleparticleTracking2008","abstract":"Single-particle tracking methods allow detailed analysis of protein movement in cells, but existing tracking algorithms have substantial limitations, particularly at high particle densities. A new software tool overcomes some of these limitations and is used to track CD36 receptors and assay the lifetime of clathrin-coated pits. Also in this issue, Sergé et al. describe an alternative software tool for high-density single-particle tracking.","accessed":{"date-parts":[[2022,8,5]]},"author":[{"family":"Jaqaman","given":"Khuloud"},{"family":"Loerke","given":"Dinah"},{"family":"Mettlen","given":"Marcel"},{"family":"Kuwata","given":"Hirotaka"},{"family":"Grinstein","given":"Sergio"},{"family":"Schmid","given":"Sandra L."},{"family":"Danuser","given":"Gaudenz"}],"citation-key":"jaqamanRobustSingleparticleTracking2008","container-title":"Nature Methods","container-title-short":"Nat Methods","DOI":"10.1038/nmeth.1237","ISSN":"1548-7105","issue":"8","issued":{"date-parts":[[2008,8]]},"language":"en","license":"2008 Nature Publishing Group","number":"8","page":"695-702","publisher":"Nature Publishing Group","source":"www.nature.com","title":"Robust single-particle tracking in live-cell time-lapse sequences","type":"article-journal","URL":"https://www.nature.com/articles/nmeth.1237","volume":"5"},
  {"id":"liberzonOpenPIVOpenpivpythonOpenPIVPython2021","abstract":"multipass with window deformation, image masking, dynamic masking, Tk GUI","accessed":{"date-parts":[[2023,1,10]]},"author":[{"family":"Liberzon","given":"Alex"},{"family":"Käufer","given":"Theo"},{"family":"Bauer","given":"Andreas"},{"family":"Vennemann","given":"Peter"},{"family":"Zimmer","given":"Erich"}],"citation-key":"liberzonOpenPIVOpenpivpythonOpenPIVPython2021","DOI":"10.5281/zenodo.5009150","issued":{"date-parts":[[2021,1,1]]},"language":"eng","publisher":"Zenodo","source":"Zenodo","title":"OpenPIV/openpiv-python: OpenPIV-Python v0.23.6","title-short":"OpenPIV/openpiv-python","type":"software","URL":"https://zenodo.org/record/5009150"},
  {"id":"moenAccurateCellTracking2019","abstract":"Live-cell imaging experiments have opened an exciting window into the behavior of living systems. While these experiments can produce rich data, the computational analysis of these datasets is challenging. Single-cell analysis requires that cells be accurately identified in each image and subsequently tracked over time. Increasingly, deep learning is being used to interpret microscopy image with single cell resolution. In this work, we apply deep learning to the problem of tracking single cells in live-cell imaging data. Using crowdsourcing and a human-in-the-loop approach to data annotation, we constructed a dataset of over 11,000 trajectories of cell nuclei that includes lineage information. Using this dataset, we successfully trained a deep learning model to perform cell tracking within a linear programming framework. Benchmarking tests demonstrate that our method achieves state-of-the-art performance on the task of cell tracking with respect to multiple accuracy metrics. Further, we show that our deep learning-based method generalizes to perform cell tracking for both fluorescent and brightfield images of the cell cytoplasm, despite having never been trained on those data types. This enables analysis of live-cell imaging data collected across imaging modalities. A persistent cloud deployment of our cell tracker is available at http://www.deepcell.org.","accessed":{"date-parts":[[2023,3,18]]},"author":[{"family":"Moen","given":"Erick"},{"family":"Borba","given":"Enrico"},{"family":"Miller","given":"Geneva"},{"family":"Schwartz","given":"Morgan"},{"family":"Bannon","given":"Dylan"},{"family":"Koe","given":"Nora"},{"family":"Camplisson","given":"Isabella"},{"family":"Kyme","given":"Daniel"},{"family":"Pavelchek","given":"Cole"},{"family":"Price","given":"Tyler"},{"family":"Kudo","given":"Takamasa"},{"family":"Pao","given":"Edward"},{"family":"Graf","given":"William"},{"family":"Valen","given":"David Van"}],"citation-key":"moenAccurateCellTracking2019","DOI":"10.1101/803205","issued":{"date-parts":[[2019,10,14]]},"language":"en","license":"© 2019, Posted by Cold Spring Harbor Laboratory. This pre-print is available under a Creative Commons License (Attribution-NonCommercial-NoDerivs 4.0 International), CC BY-NC-ND 4.0, as described at http://creativecommons.org/licenses/by-nc-nd/4.0/","page":"803205","publisher":"bioRxiv","section":"New Results","source":"bioRxiv","title":"Accurate cell tracking and lineage construction in live-cell imaging experiments with deep learning","type":"article","URL":"https://www.biorxiv.org/content/10.1101/803205v2"},
  {"id":"olshausenVisionCodingNatural2000","accessed":{"date-parts":[[2022,7,13]]},"author":[{"family":"Olshausen","given":"Bruno A."},{"family":"Field","given":"David J."}],"citation-key":"olshausenVisionCodingNatural2000","container-title":"American Scientist","ISSN":"0003-0996","issue":"3","issued":{"date-parts":[[2000]]},"page":"238-245","publisher":"Sigma Xi, The Scientific Research Society","source":"JSTOR","title":"Vision and the Coding of Natural Images: The human brain may hold the secrets to the best image-compression algorithms","title-short":"Vision and the Coding of Natural Images","type":"article-journal","URL":"http://www.jstor.org/stable/27858027","volume":"88"},
  {"id":"pizerAdaptiveHistogramEqualization1987","abstract":"Adaptive histogram equalization (ahe) is a contrast enhancement method designed to be broadly applicable and having demonstrated effectiveness. However, slow speed and the overenhancement of noise it produces in relatively homogeneous regions are two problems. We report algorithms designed to overcome these and other concerns. These algorithms include interpolated ahe, to speed up the method on general purpose computers; a version of interpolated ahe designed to run in a few seconds on feedback processors; a version of full ahe designed to run in under one second on custom VLSI hardware; weighted ahe, designed to improve the quality of the result by emphasizing pixels' contribution to the histogram in relation to their nearness to the result pixel; and clipped ahe, designed to overcome the problem of overenhancement of noise contrast. We conclude that clipped ahe should become a method of choice in medical imaging and probably also in other areas of digital imaging, and that clipped ahe can be made adequately fast to be routinely applied in the normal display sequence.","accessed":{"date-parts":[[2022,7,13]]},"author":[{"family":"Pizer","given":"Stephen M."},{"family":"Amburn","given":"E. Philip"},{"family":"Austin","given":"John D."},{"family":"Cromartie","given":"Robert"},{"family":"Geselowitz","given":"Ari"},{"family":"Greer","given":"Trey"},{"family":"Haar Romeny","given":"Bart","non-dropping-particle":"ter"},{"family":"Zimmerman","given":"John B."},{"family":"Zuiderveld","given":"Karel"}],"citation-key":"pizerAdaptiveHistogramEqualization1987","container-title":"Computer Vision, Graphics, and Image Processing","container-title-short":"Computer Vision, Graphics, and Image Processing","DOI":"10.1016/S0734-189X(87)80186-X","ISSN":"0734-189X","issue":"3","issued":{"date-parts":[[1987,9,1]]},"language":"en","page":"355-368","source":"ScienceDirect","title":"Adaptive histogram equalization and its variations","type":"article-journal","URL":"https://www.sciencedirect.com/science/article/pii/S0734189X8780186X","volume":"39"},
  {"id":"pylvanainenIfYouCan2022","abstract":"FocalPlane - Tools","accessed":{"date-parts":[[2023,3,11]]},"author":[{"family":"Pylvänäinen","given":"Joanna"}],"citation-key":"pylvanainenIfYouCan2022","container-title":"FocalPlane","issued":{"date-parts":[[2022,2,17]]},"language":"en","title":"If you can detect it, you can track it - recent TrackMate developments","type":"webpage","URL":"https://focalplane.biologists.com/2022/02/17/if-you-can-detect-it-you-can-track-it-recent-trackmate-developments/"},
  {"id":"RegulationCellCycle","accessed":{"date-parts":[[2022,8,21]]},"citation-key":"RegulationCellCycle","title":"Regulation of cell cycle progression by cell–cell and cell–matrix forces | Nature Cell Biology","type":"webpage","URL":"https://www.nature.com/articles/s41556-018-0107-2"},
  {"id":"ronnebergerUNetConvolutionalNetworks2015","abstract":"There is large consent that successful training of deep networks requires many thousand annotated training samples. In this paper, we present a network and training strategy that relies on the strong use of data augmentation to use the available annotated samples more efficiently. The architecture consists of a contracting path to capture context and a symmetric expanding path that enables precise localization. We show that such a network can be trained end-to-end from very few images and outperforms the prior best method (a sliding-window convolutional network) on the ISBI challenge for segmentation of neuronal structures in electron microscopic stacks. Using the same network trained on transmitted light microscopy images (phase contrast and DIC) we won the ISBI cell tracking challenge 2015 in these categories by a large margin. Moreover, the network is fast. Segmentation of a 512x512 image takes less than a second on a recent GPU. The full implementation (based on Caffe) and the trained networks are available at http://lmb.informatik.uni-freiburg.de/people/ronneber/u-net .","accessed":{"date-parts":[[2022,7,21]]},"author":[{"family":"Ronneberger","given":"Olaf"},{"family":"Fischer","given":"Philipp"},{"family":"Brox","given":"Thomas"}],"citation-key":"ronnebergerUNetConvolutionalNetworks2015","DOI":"10.48550/arXiv.1505.04597","issued":{"date-parts":[[2015,5,18]]},"language":"en","source":"arxiv.org","title":"U-Net: Convolutional Networks for Biomedical Image Segmentation","title-short":"U-Net","type":"article-journal","URL":"https://arxiv.org/abs/1505.04597v1"},
  {"id":"sanchez-gutierrezFundamentalPhysicalCellular2016","abstract":"Morphogenesis is driven by small cell shape changes that modulate tissue organization. Apical surfaces of proliferating epithelial sheets have been particularly well studied. Currently, it is accepted that a stereotyped distribution of cellular polygons is conserved in proliferating tissues among metazoans. In this work, we challenge these previous findings showing that diverse natural packed tissues have very different polygon distributions. We use Voronoi tessellations as a mathematical framework that predicts this diversity. We demonstrate that Voronoi tessellations and the very different tissues analysed share an overriding restriction: the frequency of polygon types correlates with the distribution of cell areas. By altering the balance of tensions and pressures within the packed tissues using disease, genetic or computer model perturbations, we show that as long as packed cells present a balance of forces within tissue, they will be under a physical constraint that limits its organization. Our discoveries establish a new framework to understand tissue architecture in development and disease.","accessed":{"date-parts":[[2023,2,9]]},"author":[{"family":"Sánchez‐Gutiérrez","given":"Daniel"},{"family":"Tozluoglu","given":"Melda"},{"family":"Barry","given":"Joseph D"},{"family":"Pascual","given":"Alberto"},{"family":"Mao","given":"Yanlan"},{"family":"Escudero","given":"Luis M"}],"citation-key":"sanchez-gutierrezFundamentalPhysicalCellular2016","container-title":"The EMBO Journal","container-title-short":"EMBO J","DOI":"10.15252/embj.201592374","ISSN":"0261-4189","issue":"1","issued":{"date-parts":[[2016,1,4]]},"page":"77-88","PMCID":"PMC4718000","PMID":"26598531","source":"PubMed Central","title":"Fundamental physical cellular constraints drive self‐organization of tissues","type":"article-journal","URL":"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4718000/","volume":"35"},
  {"id":"sinhaImageAcquisitionPreprocessing2012","accessed":{"date-parts":[[2022,7,14]]},"author":[{"family":"Sinha","given":"P. K."}],"citation-key":"sinhaImageAcquisitionPreprocessing2012","DOI":"10.1117/3.858360","event-place":"1000 20th Street, Bellingham, WA 98227-0010 USA","ISBN":"978-0-8194-8202-0","issued":{"date-parts":[[2012,1,4]]},"language":"en","publisher":"SPIE","publisher-place":"1000 20th Street, Bellingham, WA 98227-0010 USA","source":"DOI.org (Crossref)","title":"Image Acquisition and Preprocessing for Machine Vision Systems","type":"book","URL":"http://link.aip.org/link/doi/10.1117/3.858360"},
  {"id":"stimperMultidimensionalContrastLimited2019","abstract":"Contrast enhancement is an important preprocessing technique for improving the performance of downstream tasks in image processing and computer vision. Among the existing approaches based on nonlinear histogram transformations, contrast limited adaptive histogram equalization (CLAHE) is a popular choice for dealing with 2D images obtained in natural and scientific settings. The recent hardware upgrade in data acquisition systems results in significant increase in data complexity, including their sizes and dimensions. Measurements of densely sampled data higher than three dimensions, usually composed of 3D data as a function of external parameters, are becoming commonplace in various applications in the natural sciences and engineering. The initial understanding of these complex multidimensional datasets often requires human intervention through visual examination, which may be hampered by the varying levels of contrast permeating through the dimensions. We show both qualitatively and quantitatively that using our multidimensional extension of CLAHE (MCLAHE) simultaneously on all dimensions of the datasets allows better visualization and discernment of multidimensional image features, as demonstrated using cases from 4D photoemission spectroscopy and fluorescence microscopy. Our implementation of multidimensional CLAHE in Tensorflow is publicly accessible and supports parallelization with multiple CPUs and various other hardware accelerators, including GPUs.","author":[{"family":"Stimper","given":"Vincent"},{"family":"Bauer","given":"Stefan"},{"family":"Ernstorfer","given":"Ralph"},{"family":"Schölkopf","given":"Bernhard"},{"family":"Xian","given":"Rui Patrick"}],"citation-key":"stimperMultidimensionalContrastLimited2019","container-title":"IEEE Access","DOI":"10.1109/ACCESS.2019.2952899","ISSN":"2169-3536","issued":{"date-parts":[[2019]]},"page":"165437-165447","source":"IEEE Xplore","title":"Multidimensional Contrast Limited Adaptive Histogram Equalization","type":"article-journal","volume":"7"},
  {"id":"streichanSpatialConstraintsControl2014","abstract":"Spatiotemporal coordination of cell growth underlies tissue development and disease. Mechanical feedback between cells has been proposed as a regulatory mechanism for growth control both in vivo and in cultured cells undergoing contact inhibition of proliferation. Evidence beyond theoretical and correlative observations falls short. In this study, we probe the impact of mechanical tissue perturbations on cell cycle progression by monitoring cell cycle dynamics of cells in tissues subject to acute changes in boundary conditions, as well as tissue stretching and compression. Taken together, we conclude that the ability of tissues to support cell cycle progression adapts to the available space through a memory-free control mechanism, which may coordinate proliferation patterns to maintain tissue homeostasis., Control of cell proliferation is a fundamental aspect of tissue formation in development and regeneration. Cells experience various spatial and mechanical constraints depending on their environmental context in the body, but we do not fully understand if and how such constraints influence cell cycle progression and thereby proliferation patterns in tissues. Here, we study the impact of mechanical manipulations on the cell cycle of individual cells within a mammalian model epithelium. By monitoring the response to experimentally applied forces, we find a checkpoint at the G1–S boundary that, in response to spatial constraints, controls cell cycle progression. This checkpoint prevents cells from entering S phase if the available space remains below a characteristic threshold because of crowding. Stretching the tissue results in fast cell cycle reactivation, whereas compression rapidly leads to cell cycle arrest. Our kinetic analysis of this response shows that cells have no memory of past constraints and allows us to formulate a biophysical model that predicts tissue growth in response to changes in spatial constraints in the environment. This characteristic biomechanical cell cycle response likely serves as a fundamental control mechanism to maintain tissue integrity and to ensure control of tissue growth during development and regeneration.","accessed":{"date-parts":[[2022,11,23]]},"author":[{"family":"Streichan","given":"Sebastian J."},{"family":"Hoerner","given":"Christian R."},{"family":"Schneidt","given":"Tatjana"},{"family":"Holzer","given":"Daniela"},{"family":"Hufnagel","given":"Lars"}],"citation-key":"streichanSpatialConstraintsControl2014","container-title":"Proceedings of the National Academy of Sciences of the United States of America","container-title-short":"Proc Natl Acad Sci U S A","DOI":"10.1073/pnas.1323016111","ISSN":"0027-8424","issue":"15","issued":{"date-parts":[[2014,4,15]]},"page":"5586-5591","PMCID":"PMC3992650","PMID":"24706777","source":"PubMed Central","title":"Spatial constraints control cell proliferation in tissues","type":"article-journal","URL":"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3992650/","volume":"111"},
  {"id":"stringerCellposeGeneralistAlgorithm2020","abstract":"Many biological applications require the segmentation of cell bodies, membranes and nuclei from microscopy images. Deep learning has enabled great progress on this problem, but current methods are specialized for images that have large training datasets. Here we introduce a generalist, deep learning-based segmentation algorithm called Cellpose, which can very precisely segment a wide range of image types out-of-the-box and does not require model retraining or parameter adjustments. We trained Cellpose on a new dataset of highly-varied images of cells, containing over 70,000 segmented objects. To support community contributions to the training data, we developed software for manual labelling and for curation of the automated results, with optional direct upload to our data repository. Periodically retraining the model on the community-contributed data will ensure that Cellpose improves constantly.","accessed":{"date-parts":[[2022,7,21]]},"author":[{"family":"Stringer","given":"Carsen"},{"family":"Michaelos","given":"Michalis"},{"family":"Pachitariu","given":"Marius"}],"citation-key":"stringerCellposeGeneralistAlgorithm2020","DOI":"10.1101/2020.02.02.931238","issued":{"date-parts":[[2020,2,3]]},"language":"en","license":"© 2020, Posted by Cold Spring Harbor Laboratory. This pre-print is available under a Creative Commons License (Attribution-NonCommercial 4.0 International), CC BY-NC 4.0, as described at http://creativecommons.org/licenses/by-nc/4.0/","page":"2020.02.02.931238","publisher":"bioRxiv","section":"New Results","source":"bioRxiv","title":"Cellpose: a generalist algorithm for cellular segmentation","title-short":"Cellpose","type":"article","URL":"https://www.biorxiv.org/content/10.1101/2020.02.02.931238v1"},
  {"id":"taiebFUCCItrackAllinoneSoftware2022","abstract":"Beyond the more conventional single-cell segmentation and tracking, single-cell cycle dynamics is gaining a growing interest in the field of cell biology. Thanks to sophisticated systems, such as the fluorescent ubiquitination-based cell cycle indicator (FUCCI), it is now possible to study cell proliferation, migration, changes in nuclear morphology and single cell cycle dynamics, quantitatively and in real time. In this work, we introduce FUCCItrack, an all-in-one, semi-automated software to segment, track and visualize FUCCI modified cell lines. A user-friendly complete graphical user interface is presented to record and quantitatively analyze both collective cell proliferation as well as single cell information, including migration and changes in nuclear or cell morphology as a function of cell cycle. To enable full control over the analysis, FUCCItrack also contains features for identification of errors and manual corrections.","accessed":{"date-parts":[[2022,11,23]]},"author":[{"family":"Taïeb","given":"Hubert M."},{"family":"Bertinetti","given":"Luca"},{"family":"Robinson","given":"Tom"},{"family":"Cipitria","given":"Amaia"}],"citation-key":"taiebFUCCItrackAllinoneSoftware2022","container-title":"PLOS ONE","container-title-short":"PLOS ONE","DOI":"10.1371/journal.pone.0268297","ISSN":"1932-6203","issue":"7","issued":{"date-parts":[[2022,7,6]]},"language":"en","page":"e0268297","publisher":"Public Library of Science","source":"PLoS Journals","title":"FUCCItrack: An all-in-one software for single cell tracking and cell cycle analysis","title-short":"FUCCItrack","type":"article-journal","URL":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0268297","volume":"17"},
  {"id":"taiebFUCCItrackAllinoneSoftware2022a","abstract":"Beyond the more conventional single-cell segmentation and tracking, single-cell cycle dynamics is gaining a growing interest in the field of cell biology. Thanks to sophisticated systems, such as the fluorescent ubiquitination-based cell cycle indicator (FUCCI), it is now possible to study cell proliferation, migration, changes in nuclear morphology and single cell cycle dynamics, quantitatively and in real time. In this work, we introduce FUCCItrack, an all-in-one, semi-automated software to segment, track and visualize FUCCI modified cell lines. A user-friendly complete graphical user interface is presented to record and quantitatively analyze both collective cell proliferation as well as single cell information, including migration and changes in nuclear or cell morphology as a function of cell cycle. To enable full control over the analysis, FUCCItrack also contains features for identification of errors and manual corrections.","accessed":{"date-parts":[[2022,8,17]]},"author":[{"family":"Taïeb","given":"Hubert M."},{"family":"Bertinetti","given":"Luca"},{"family":"Robinson","given":"Tom"},{"family":"Cipitria","given":"Amaia"}],"citation-key":"taiebFUCCItrackAllinoneSoftware2022a","container-title":"PLOS ONE","container-title-short":"PLOS ONE","DOI":"10.1371/journal.pone.0268297","ISSN":"1932-6203","issue":"7","issued":{"date-parts":[[2022,7,6]]},"language":"en","page":"e0268297","publisher":"Public Library of Science","source":"PLoS Journals","title":"FUCCItrack: An all-in-one software for single cell tracking and cell cycle analysis","title-short":"FUCCItrack","type":"article-journal","URL":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0268297","volume":"17"},
  {"id":"taiebOsmoticPressureModulates2021","abstract":"Biophysical cues such as osmotic pressure modulate proliferation and growth arrest of bacteria, yeast cells and seeds. In tissues, osmotic regulation takes place through blood and lymphatic capillaries and, at a single cell level, water and osmoregulation play a critical role. However, the effect of osmotic pressure on single cell cycle dynamics remains poorly understood. Here, we investigate the effect of osmotic pressure on single cell cycle dynamics, nuclear growth, proliferation, migration and protein expression, by quantitative time-lapse imaging of single cells genetically modified with fluorescent ubiquitination-based cell cycle indicator 2 (FUCCI2). Single cell data reveals that under hyperosmotic stress, distinct cell subpopulations emerge with impaired nuclear growth, delayed or growth arrested cell cycle and reduced migration. This state is reversible for mild hyperosmotic stress, where cells return to regular cell cycle dynamics, proliferation and migration. Thus, osmotic pressure can modulate the reversible growth arrest and reactivation of human metastatic cells.","accessed":{"date-parts":[[2022,8,18]]},"author":[{"family":"Taïeb","given":"Hubert M."},{"family":"Garske","given":"Daniela S."},{"family":"Contzen","given":"Jörg"},{"family":"Gossen","given":"Manfred"},{"family":"Bertinetti","given":"Luca"},{"family":"Robinson","given":"Tom"},{"family":"Cipitria","given":"Amaia"}],"citation-key":"taiebOsmoticPressureModulates2021","container-title":"Scientific Reports","container-title-short":"Sci Rep","DOI":"10.1038/s41598-021-92054-w","ISSN":"2045-2322","issue":"1","issued":{"date-parts":[[2021,6,29]]},"language":"en","license":"2021 The Author(s)","number":"1","page":"13455","publisher":"Nature Publishing Group","source":"www.nature.com","title":"Osmotic pressure modulates single cell cycle dynamics inducing reversible growth arrest and reactivation of human metastatic cells","type":"article-journal","URL":"https://www.nature.com/articles/s41598-021-92054-w","volume":"11"},
  {"id":"taylorParticleImageVelocimetry","abstract":"Emerging imaging techniques have opened new fronts to investigate tissues, cells, and proteins. Transformative technologies such as microCT scans, super-resolution microscopy, fluorescence-based tools, and other methods now allow us to study the mechanics of cancer, dissect the origins of cellular force regulation, and examine biological specimens at the nanoscale.\nThe Handbook of Imaging in Biological Mechanics presents the spectrum of imaging techniques used for noninvasive visualization of th","accessed":{"date-parts":[[2023,1,10]]},"author":[{"family":"Taylor","given":"Zachary J."},{"family":"Gurka","given":"Roi"},{"family":"Liberzon","given":"Alex"}],"citation-key":"taylorParticleImageVelocimetry","container-title":"Handbook of Imaging in Biological Mechanics","language":"en","page":"173-183","title":"Particle Image Velocimetry for Biological Mechanics","type":"chapter","URL":"https://www.routledge.com/Handbook-of-Imaging-in-Biological-Mechanics/Neu-Genin/p/book/9781466588134"},
  {"id":"tinevezTrackMateOpenExtensible2017","abstract":"We present TrackMate, an open source Fiji plugin for the automated, semi-automated, and manual tracking of single-particles. It offers a versatile and modular solution that works out of the box for end users, through a simple and intuitive user interface. It is also easily scriptable and adaptable, operating equally well on 1D over time, 2D over time, 3D over time, or other single and multi-channel image variants. TrackMate provides several visualization and analysis tools that aid in assessing the relevance of results. The utility of TrackMate is further enhanced through its ability to be readily customized to meet specific tracking problems. TrackMate is an extensible platform where developers can easily write their own detection, particle linking, visualization or analysis algorithms within the TrackMate environment. This evolving framework provides researchers with the opportunity to quickly develop and optimize new algorithms based on existing TrackMate modules without the need of having to write de novo user interfaces, including visualization, analysis and exporting tools. The current capabilities of TrackMate are presented in the context of three different biological problems. First, we perform Caenorhabditis-elegans lineage analysis to assess how light-induced damage during imaging impairs its early development. Our TrackMate-based lineage analysis indicates the lack of a cell-specific light-sensitive mechanism. Second, we investigate the recruitment of NEMO (NF-κB essential modulator) clusters in fibroblasts after stimulation by the cytokine IL-1 and show that photodamage can generate artifacts in the shape of TrackMate characterized movements that confuse motility analysis. Finally, we validate the use of TrackMate for quantitative lifetime analysis of clathrin-mediated endocytosis in plant cells.","accessed":{"date-parts":[[2023,3,12]]},"author":[{"family":"Tinevez","given":"Jean-Yves"},{"family":"Perry","given":"Nick"},{"family":"Schindelin","given":"Johannes"},{"family":"Hoopes","given":"Genevieve M."},{"family":"Reynolds","given":"Gregory D."},{"family":"Laplantine","given":"Emmanuel"},{"family":"Bednarek","given":"Sebastian Y."},{"family":"Shorte","given":"Spencer L."},{"family":"Eliceiri","given":"Kevin W."}],"citation-key":"tinevezTrackMateOpenExtensible2017","collection-title":"Image Processing for Biologists","container-title":"Methods","container-title-short":"Methods","DOI":"10.1016/j.ymeth.2016.09.016","ISSN":"1046-2023","issued":{"date-parts":[[2017,2,15]]},"language":"en","page":"80-90","source":"ScienceDirect","title":"TrackMate: An open and extensible platform for single-particle tracking","title-short":"TrackMate","type":"article-journal","URL":"https://www.sciencedirect.com/science/article/pii/S1046202316303346","volume":"115"},
  {"id":"VanvalenlabDeepcelltf2023","abstract":"Deep Learning Library for Single Cell Analysis","accessed":{"date-parts":[[2023,3,18]]},"citation-key":"VanvalenlabDeepcelltf2023","genre":"Python","issued":{"date-parts":[[2023,3,16]]},"original-date":{"date-parts":[[2018,5,16]]},"publisher":"vanvalenlab","source":"GitHub","title":"vanvalenlab/deepcell-tf","type":"software","URL":"https://github.com/vanvalenlab/deepcell-tf"},
  {"id":"zielkeFUCCISensorsPowerful2015","abstract":"Visualizing the cell cycle behavior of individual cells within living organisms can facilitate the understanding of developmental processes such as pattern formation, morphogenesis, cell differentiation, growth, cell migration, and cell death. Fluorescence Ubiquitin Cell Cycle Indicator (FUCCI) technology offers an accurate, versatile, and universally applicable means of achieving this end. In recent years, the FUCCI system has been adapted to several model systems including flies, fish, mice, and plants, making this technology available to a wide range of researchers for studies of diverse biological problems. Moreover, a broad range of FUCCI-expressing cell lines originating from diverse cell types have been generated, hence enabling the design of advanced studies that combine in vivo experiments and cell-based methods such as high-content screening. Although only a short time has passed since its introduction, the FUCCI technology has already provided fundamental insight into how cells establish quiescence and how G1 phase length impacts the balance between pluripotency and stem cell differentiation. Further discoveries using the FUCCI technology are sure to come. WIREs Dev Biol 2015, 4:469–487. doi: 10.1002/wdev.189 This article is categorized under: Adult Stem Cells, Tissue Renewal, and Regeneration > Methods and Principles Technologies > Generating Chimeras and Lineage Analysis Technologies > Analysis of Cell, Tissue, and Animal Phenotypes","accessed":{"date-parts":[[2022,8,18]]},"author":[{"family":"Zielke","given":"N."},{"family":"Edgar","given":"B. A."}],"citation-key":"zielkeFUCCISensorsPowerful2015","container-title":"WIREs Developmental Biology","DOI":"10.1002/wdev.189","ISSN":"1759-7692","issue":"5","issued":{"date-parts":[[2015]]},"language":"en","page":"469-487","source":"Wiley Online Library","title":"FUCCI sensors: powerful new tools for analysis of cell proliferation","title-short":"FUCCI sensors","type":"article-journal","URL":"https://onlinelibrary.wiley.com/doi/abs/10.1002/wdev.189","volume":"4"},
  {"id":"zotero-290","citation-key":"zotero-290","type":"book"},
  {"id":"zuiderveldVIIIContrastLimited1994","accessed":{"date-parts":[[2022,7,13]]},"author":[{"family":"Zuiderveld","given":"Karel"}],"citation-key":"zuiderveldVIIIContrastLimited1994","container-title":"Graphics Gems","DOI":"10.1016/B978-0-12-336156-1.50061-6","editor":[{"family":"Heckbert","given":"Paul S."}],"ISBN":"978-0-12-336156-1","issued":{"date-parts":[[1994,1,1]]},"language":"en","page":"474-485","publisher":"Academic Press","source":"ScienceDirect","title":"VIII.5. - Contrast Limited Adaptive Histogram Equalization","type":"chapter","URL":"https://www.sciencedirect.com/science/article/pii/B9780123361561500616"}
]
